[
  {
    "id": 3,
    "author": "Machado de Assis",
    "description": "Joaquim Maria Machado de Assis (Rio de Janeiro, 21 de junho de 1839 — Rio de Janeiro, 29 de setembro de 1908) foi um escritor brasileiro, considerado por muitos críticos, estudiosos, escritores e leitores um dos maiores senão o maior nome da literatura do Brasil. Obras Romances Ressurreição, (1872) A mão e a luva, (1874) Helena, (1876) Iaiá Garcia, (1878) Memórias Póstumas de Brás Cubas, (1881) Casa Velha, (1885) Quincas Borba, (1891) Dom Casmurro, (1899) Esaú e Jacó, (1904) Memorial de Aires, (1908) Coletânea de contos Contos Fluminenses, (1870) Histórias da Meia-Noite, (1873) Papéis Avulsos, (1882) Histórias sem Data, (1884) Várias Histórias, (1896) Páginas Recolhidas, (1899) Relíquias da Casa Velha, (1906)",
    "image_link": "http://books.google.com/books/content?id=A3bNDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "published_date": "2020",
    "subtitle": "obras completas",
    "title": "Machado de Assis"
  },
  {
    "id": 4,
    "author": "Machado de Assis",
    "description": "Existe algo pior para a alma do que a dúvida? Do que a incerteza frente a fatos confusos? Bentinho, o narrador desta história, escreve o livro para tentar provar que suas ações não foram simplesmente baseadas em um ciúme cego e irracional, mas, ao contrário, que suas impressões estavam corretas.Fora criado junto com Capitu desde criança, e, pouco antes de entrar no seminário, por ter sido obrigado, jurara amor eterno à vizinha dos famosos 'olhos de cigana oblíqua e dissimulada'. Quando finalmente consegue se livrar da carreira de padre, casa-se com ela e fica muito feliz, até a hora que Bentinho se questiona sobre um possível romance entre sua mulher e seu melhor amigo. Capitu, a moça dos 'mais belos braços da noite', traiu ou não Bentinho? Será que as semelhanças de seu filho com seu amigo são provas do adultério, ou são mais uma obra do acaso?",
    "image_link": "http://books.google.com/books/content?id=UCq7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "title": "Dom Casmurro",
    "subtitle": "",
    "published_date": "2016"
  },
  {
    "id": 5,
    "title": "Memórias póstumas de Brás Cubas",
    "subtitle": "",
    "author": "Machado de Assis",
    "published_date": "1963",
    "description": "Machado de Assis captou na sociedade carioca do século XIX a essência humana, e por meio de suas personagens, dotadas de ações comuns, extrai temas como o adultério, a vaidade, o ciúme, a racionalidade e o egoísmo. Na voz de um defunto-autor, 'Memórias Póstumas de Brás Cubas' constrói-se num tom sarcástico e mordaz. A ausência de descrições e o foco na análise psicológica fazem dos romances machadianos uma narrativa atual e instigante.",
    "image_link": "http://books.google.com/books/content?id=8bdcAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
  },
  {
    "id": 6,
    "title": "50 contos de Machado de Assis",
    "subtitle": "",
    "author": "Machado de Assis",
    "published_date": "2019",
    "description": "Antologia indispensável com o melhor dos contos do grande escritor brasileiro. Leitura obrigatória do vestibular da Unicamp. Um homem que tem o estranho prazer de torturar ratos, e encara a morte da mulher com a mesma satisfação; outro que, abandonado numa fazenda, se olha num espelho e descobre que seu reflexo desapareceu; uma mulher tão obcecada em esconder a idade que impede a filha de se casar; um afortunado compositor de melodias populares que deseja desesperadamente escrever música clássica; um rapazinho de quinze anos que se deixa empolgar pela visão dos braços de uma mulher mais velha; um casal empobrecido que adora dançar e termina esbanjando numa festa o prêmio ganho na loteria... Essas são algumas das situações e personagens desta nova antologia de contos de Machado de Assis, que inclui textos famosos, mas também escolhas menos usuais, além de uma apresentação convidativa e de notas esclarecedoras. Seja você um aficionado pela obra de Machado ou apenas um entusiasta da boa literatura, a amplitude e sutileza destes escritos, o prazer que se extrai da maneira como as histórias são contadas e da observação de pequenos detalhes vão fazê-lo ler, reler e redescobrir o maior escritor brasileiro. Carlos Drummond de Andrade dizia que ler Machado de Assis era uma tentação permanente, quase como um vício a que tivesse de resistir: não há melhor lugar para se dedicar a esse vício do que este livro.",
    "image_link": "http://books.google.com/books/content?id=11-IDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
  },
  {
    "id": 7,
    "title": "Contos de Amor e Ciúmes",
    "subtitle": "",
    "author": "Machado de Assis",
    "published_date": "2008",
    "description": "Contos de amor e ciúme reúne seis contos publicados originalmente entre 1864 e 1884, em periódicos como o Jornal das famílias, A estação e a Gazeta de Notícias. Histórias famosas do escritor, como \"A cartomante\" e \"To be or not to be\", convivem com outras menos conhecidas do público atual como \"Frei Simão\", \"O segredo de Augusta\", \"O machete\" e \"Curiosidade\", além do delicado poema \"A Carolina\", publicado em 1906, em que Machado faz uma homenagem a sua mulher, morta dois anos antes. Em todos eles, Machado reflete sobre a face oculta do amor por meio de histórias muito bem construídas e ricas de múltiplos significados. Segundo Gustavo Bernardo, iniciar a leitura de Machado de Assis pelos contos é uma boa forma de se familiarizar com a sua obra e despertar nos jovens a paixão pelo grande escritor. Para ele, \"o texto de Machado de Assis não é de modo algum hermético e suas sutilezas irônicas fazem um bom par com a ironia natural dos jovens\". De fato, a ironia está presente em toda a obra de Machado, e não poderia ser diferente nos contos que compõem o livro, seja para provocar reflexões sobre as relações humanas ou criticar as instituições políticas, sociais e religiosas. Como explica Gustavo Bernardo na apresentação da obra: \"O amor, muitas vezes associado ao ciúme ou ao medo extremo da traição, serve também de vitrine para o autor expor a sua verve crítica e irônica sobre o comportamento da sociedade no fim do século XIX.\"",
    "image_link": "http://books.google.com/books/content?id=6TuFkpK7cbAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
  }
]